var arr = ['马兰, 影视1工作室',
'刘琳,	影视1工作室',
'曾贇,	影视2工作室',
'王高阳,	影视2工作室',
'王禹涵,	影视2工作室',
'蒋伯骏,	影视2工作室',
'刘妍,	影视2工作室',
'钱路,	影视2工作室',
'高洋,	影视2工作室',
'王彤,	影视3工作室',
'蘧彤彤,	影视3工作室',
'赵孟凡,	影视3工作室',
'陈文龙,	影视3工作室',
'雷丙鑫,	影视3工作室',
'芦悦,	影视3工作室',
'薛理敏,	文学策划部',
'王晓萌,	文学策划部',
'史月,	文学策划部',
'王思涵,	文学策划部',
'李美玥,	文学策划部',
'叶言真,	文学策划部',
'蓝雅娜,	影视制作中心',
'胡楠,	音乐产品中心',
'李依纳,	演出运营部',
'贾茹,	头部工作室',
'倪毅,	Waa Music',
'于紫东,	Waa Music',
'吕聪,	Waa Music',
'冯时,	Gee Music',
'金彦君,	Gee Music',
'王希,	Gee Music',
'刘彤,	版权运营部',
'郭冠男,	版权运营部',
'崔梓琰,	版权运营部',
'鞠鸿鹏,	会员产品部',
'高绮蔚,	会员产品部',
'蒋文夏,	会员产品部',
'高雨欣,	会员产品部',
'桑蕊,	会员产品部',
'陈静怡,	品牌公关部',
'赵昱琳,	品牌公关部',
'李雨薇,	品牌公关部',
'樊昭锦,	品牌公关部',
'龙承菲,	品牌公关部',
'杨晓榆,	品牌公关部',
'赵硕,	音乐经纪中心',
'王云琦,	音乐经纪中心',
'单孟情,	音乐经纪中心',
'杜禹潼,	艺人经纪二部',
'郁立翱,	艺人经纪二部',
'聂子涵,	艺人经纪二部',
'修美乔,	艺人经纪二部',
'赵莎莉,	艺人经纪四部',
'邹奇格,	艺人经纪四部',
'孙晓羽,	艺人经纪四部',
'李筱竹,	艺人经纪四部',
'刘子钰,	艺人经纪四部',
'张盼盼,	艺人经纪四部',
'刘晨,	艺人经纪四部',
'王春婷,	艺人经纪四部',
'王文瑄,	艺人经纪四部',
'史玉蓉,	艺人经纪四部',
'杨晓莹,	艺人经纪五部',
'杨彩,	艺人经纪五部',
'张畅,	艺人经纪五部',
'陈洁,	艺人经纪五部',
'林慧洁,	艺人经纪五部',
'刘洺恺,	艺人经纪五部',
'焦童童,	艺人经纪五部',
'孙卫月,	艺人经纪五部',
'陆东玥,	商务开发部',
'龚澄,	商务开发部',
'田慧,	影视经纪中心',
'陈星,	艺人经纪六部',
'高明君,	艺人经纪六部',
'王萌,	艺人经纪六部',
'蒋沁雪,	艺人经纪六部',
'杨明,	艺人经纪六部',
'王殊瑾,	艺人经纪八部',
'张贺双,	艺人经纪八部',
'王瑾,	艺人经纪八部',
'刚义,	艺人经纪八部',
'王芳,	艺人经纪八部',
'刘禹芪,	艺人经纪八部',
'戴翎,	艺人经纪九部',
'张媛媛,	艺人经纪九部',
'张鹿原,	艺人经纪九部',
'张稀然,	艺人经纪九部',
'刘方,	树苗经纪部',
'张晨曦,	树苗经纪部',
'谌特亮,	新人开发中心',
'磨巧玲,	选角部',
'张恒志,	选角部',
'孙溥萱,	选角部',
'郑达,	选角部',
'姜楠,	管培部',
'向芷筠,	管培部',
'倪可欣,	运营部（新人）',
'陈雯,	运营部（新人）',
'鹿文萃,	战略发展部',
'呼琰,	财务部',
'韩冰,	财务部',
'王征,	财务部',
'王筱曼,	财务部',
'张雪岩,	财务部',
'邢蕾,	财务部',
'唐晓婉,	财务部',
'鞠琳,	财务部',
'戴佳芮,	财务部',
'严若宇,	财务部',
'皮新妹,	财务部',
'王柯彬,	财务部',
'彭丽娜,	财务部',
'冯安安,	法务部',
'韩笑,	法务部',
'史晓梅,	法务部',
'魏鑫,	法务部',
'周雪琦,	法务部',
'王双,	人力资源部',
'王晨,	人力资源部',
'张琳,	人力资源部',
'冯月,	人力资源部',
'卢美合,	人力资源部',
'许雪涛,	人力资源部',
'吴艳,	行政部',
'胡宏伟,	行政部',
'杨哲,	行政部',
'王欣桐,	行政部',
'高爽,	行政部',
'章健,	行政部',
'程一凡,	行政部',
'陈阳,	行政部',
'刘子夏,	春日部工作室',
'李岳成,	春日部工作室',
'胡斌,	春日部工作室',
'王建朝,	春日部工作室',
'欧阳易蔓,	春日部工作室',
'邢艳艳,	春日部工作室',
'彭聆,	节目很2工作室',
'王力民,	节目很2工作室',
'刘真,	节目很2工作室',
'蒯琀兮,	节目很2工作室',
'陈昱杉,	毛雪汪工作室',
'王耶聿非,	毛雪汪工作室',
'杨晶晶,	项目管理中心',
'王美凤,	项目管理中心',
'孟靖凯,	项目管理中心',
'唐勇,	项目管理中心',
'孙明月,	项目管理中心',
'朱樱子,	项目管理中心',
'钟颖,	项目管理中心',
'商柏秋,	项目管理中心',
'陆紫嫣,	榴莲工作室',
'李泽豪,	榴莲工作室',
'白翔,	榴莲工作室',
'杨康宁,	节目很2工作室',
'焉栩嘉, 艺人',
'谷嘉诚, 艺人',
'伍嘉成, 艺人',
'郭子凡, 艺人',
'赵磊,	艺人',
'夏之光, 艺人',
'彭楚粤, 艺人',
'毛不易, 艺人',
'周震南, 艺人',
'马伯骞, 艺人',
'廖俊涛, 艺人',
'张洢豪, 艺人',
'蔡维泽, 艺人',
'翟潇闻, 艺人',
'张嘉元, 艺人',
'田鸿杰, 艺人',
'马哲,	艺人',
'赵珂,	艺人',
'李润祺, 艺人',
'蒋先贵, 艺人',
'庄主恒, 艺人',
'张睿熙, 艺人',
'邰衍智, 艺人',
'朱子昊, 艺人',
'陈俊旭, 艺人',
'王世承, 艺人',
'黄羿嘉, 艺人',
'沈毅峯, 艺人',
'黄盼盼, 艺人']






// 龙丹妮
// 毛不易
// 蒋先贵
// 廖俊涛
// 蔡维泽
// 李沂邦
// 徐维均
// 郑光良
// 赵珂
// 田鸿杰    
// 马哲
// 李润琪
// 周震南
// 赵磊
// 张嘉元
// 伍嘉成
// 彭楚粤
// 谷嘉诚
// 马伯骞
// 翟潇闻
// 夏之光
// 焉栩嘉
// 郭子凡
// 张洢豪
// 庄主恒
// 原野
// 朱衍丞
// 张睿熙
// 邰衍智
// 朱子昊
// 王世承
// 黄羿嘉
// 沈毅峯
// 陈俊旭
// 陈刚
// 阿kenn
// 彬子
// tina
// 郑梦秋
// 林燕燕
// 刘亨博

// arr = str.split(',')

var allArr = []
for(var i = 0; i < arr.length; i++){
  var obj = {}
  obj.phone = 'No.' + (i + 1)
  obj.name = arr[i].split(',')[0].replace(/\t/g, "")
  obj.department = arr[i].split(',')[1].replace(/\t/g, "")
	allArr.push(obj)
}
console.log(JSON.stringify(allArr))